# Simple single-layer network to showcase editing model parameters.
name: "convolution"
<<<<<<< HEAD
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 1 dim: 100 dim: 100 } }
}
=======
input: "data"
input_dim: 1
input_dim: 1
input_dim: 100
input_dim: 100
>>>>>>> 28a579eaf0668850705598b3075b8969f22226d9
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    num_output: 3
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
